Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
            errorcnt = 0;
            buflen = 0;
            bufptr = buffer;            
        }
    }
   
    if(!found) 
    {
        //syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
    }
    else 
    {
        found = false;

        if (stmStatus==STM_NOT_READY) stmStatus=STM_READY;
        stmFailed=false;
        // devide buffer into command and data
		// ****************************************

        cmdptr = buffer;
        argcnt = 0;
        noToken = 0;
        //UART_DBG.println("cmdbuffer "+String(cmdptr));

        // Returns first token
        char *token = strtok(cmdptr, " ");
        strncpy(cmd,token,sizeof(cmd)-1);		// command
        // Keep get tokens while one of the
        // delimiters present in buffer.
        //UART_DBG.println("token1 "+String(token));
        while (token != NULL)
        {
            if (noToken>0) { 
                //UART_DBG.println("token "+String(token));
                memset (argptr[noToken-1],0x0,argSize[noToken-1]);
                strncpy(argptr[noToken-1],token,argSize[noToken-1]-1); 
                argcnt++;
            }
            token = strtok(NULL, " ");
            noToken++;
            if (noToken>noOfArgs) break;
        }

		// get actual values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		if(memcmp(APP_PRE_GETACTUALPOS,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:actual position answer "+String(argptr[0])+" : "+String(argptr[1]));
                }
                actuators[atoi(argptr[0])].actual_position = atoi(argptr[1]);
            }
            appState=APP_IDLE;
        }

        // get mean current 
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETMEANCURR,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:mean current answer "+String(argptr[0])+" : "+String(argptr[1]));  
                }
                actuators[atoi(argptr[0])].meancurrent = atoi(argptr[1]);
            }
            appState=APP_IDLE;
        }
    
        // get valve status
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLSTATUS,cmd,5) == 0) { 
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:valve status "+String(argptr[1]));
                }
                uint8_t nActuators = atoi(argptr[0]);
                char* cmdptr;
                char* ps=argptr[1];
                for (uint8_t idx=0; idx<nActuators;idx++) {
                    if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                    val8 = atoi(ps);
                    actuators[idx].state = (val8 & 0x7f);
                    actuators[idx].calibration =  (val8>=0x80);
                    if (cmdptr!=NULL) ps=cmdptr+1;
                    idx++;
                }  
                stmStatus=STM_READ_ALL_FROM_QUEUE;  
                if (stmInitState==STM_INIT_STARTED) stmInitState=STM_INIT_FINISHED ;
            }
            appState=APP_IDLE;
        }

        // get set target answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_SETTARGETPOS,cmd,5) == 0) {
            if(argcnt == 0) {
                settarget_check = true; 
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }
        // get target position
            // ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            else if(memcmp(APP_PRE_GETTARGETPOS,cmd,5) == 0) {
                if(argcnt == 2) {
                    actuators[atoi(argptr[0])].target_position = atoi(argptr[1]);
                }
                appState=APP_IDLE;
            }

        // get data values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLVDATA,cmd,5) == 0) {
            if(argcnt >= 6) {
                uint8_t idx=atoi(argptr[0]);
                if(idx < ACTUATOR_COUNT) {
                    actuators[idx].actual_position = atoi(argptr[1]);
                    actuators[idx].meancurrent = atoi(argptr[2]);
                    val8 = atoi(argptr[3]);
                    actuators[idx].state = (val8 & 0x7f);
                    actuators[idx].calibration = (val8>=0x80);
                    actuators[idx].temp1 = ConvertCF(atoi(argptr[4]))+getTOffset(actuators[idx].tIdx1);
                    actuators[idx].temp2 =  ConvertCF(atoi(argptr[5]))+getTOffset(actuators[idx].tIdx2);
                    if (argcnt >= 10) {
                        actuators[idx].movements = atoi(argptr[6]);   
                        actuators[idx].opening_count = atoi(argptr[7]);
                        actuators[idx].closing_count = atoi(argptr[8]);
                        actuators[idx].deadzone_count = atoi(argptr[9]); 
                    }
                    if (argcnt >= 11) {
                        actuators[idx].calibRetries = atoi(argptr[10]); 
                    }
                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG, "STMApp:got valve data #"+String(argptr[0])+" pos:"+String(argptr[1])+
                        " mean:"+String(argptr[2])+" state:"+String(argptr[3])+" t1:"+String(argptr[4])+" t2:"+String(argptr[5]));
                    }

                    if (actuators[idx].state!=actuators[idx].lastState) {
                        switch (actuators[idx].state) {
                            case VLV_STATE_OPENING:
                            case VLV_STATE_CLOSING:
                            {
                                actuators[idx].worked = true;
                                break;    
                            }
                            case VLV_STATE_FAILED:
                            {
                                if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.valveFailed) {
                                    String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                    String s = "Valve "+String(idx+1)+" failed";
                                    Messenger.sendMessage (title.c_str(),s.c_str());
                                }
                                break;
                            }
                            case VLV_STATE_OPENCIR:
                            {
                                if ((actuators[idx].worked) && (VdmConfig.configFlash.valvesConfig.valveConfig[idx].active)) { // has previous worked correctly
                                    if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.notDetect) {
                                        String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                        String s = "Valve "+String(idx+1)+" is not connected";
                                        Messenger.sendMessage (title.c_str(),s.c_str());
                                    }
                                }
                                break;
                            }
                            case VLV_STATE_BLOCKS:
                            {
                                if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.valveBlocked) {
                                    String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                    String s = "Valve "+String(idx+1)+" is blocked";
                                    Messenger.sendMessage (title.c_str(),s.c_str());
                                }
                                break;
                            }
                        } 
                    }
                    actuators[idx].lastState=actuators[idx].state;
                }
            } 
            appState=APP_IDLE;
        }

        // get temp onewire data answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        
        else if(memcmp(APP_PRE_GETONEWIRECNT,cmd,5) == 0) {
            if(argcnt == 1) {
                tempsPrivCount= atoi(argptr[0]); 
                if (tempsPrivCount!=tempsCount) app_cmd(APP_PRE_GETONEWIRECNT,String(255));
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp count "+String(tempsPrivCount));
                }       
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp data "+String(argptr[1]));
                } 
                tempsPrivCount= atoi(argptr[0]);
                if (tempsPrivCount>0) {
                    char* cmdptr;
                    char* ps=argptr[1];
                    for (uint8_t idx=0; idx<tempsPrivCount;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(tempsId[idx].id,ps,sizeof(tempsId[idx].id));
                        ps=cmdptr+1;
                        idx++;
                    }
                }
                tempsCount=tempsPrivCount;
            }
            if (tempsPrivCount==0) {
                fastGetOneWire=false;
               // oneWireAllRead=true;
            }
            appState=APP_IDLE;
        }

		else if(memcmp(APP_PRE_GETONEWIREDATA,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp data "+String(argptr[0])+":"+String(argptr[1]));
                } 
                strncpy(tempsId[tempIndex].id,argptr[0],sizeof(tempsId[tempIndex].id));

