Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
                    }
                }
                
            }  
            appState=APP_IDLE;
        }
        
        else if(memcmp(APP_PRE_SETONEWIRESEARCH,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETLEARNMOVEM,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETLEARNMOVEM,cmd,5) == 0) {
            if(argcnt == 1) {
                learnAfterMovements=atoi(argptr[0]);
            }
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETVLVSENSOR,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETALLVLVOPEN,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETVLLEARN,cmd,5) == 0) {
            appState=APP_IDLE;
        }
        
        else if(memcmp(APP_PRE_SETDETECTVLV,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETMOTCHARS,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETMOTCHARS,cmd,5) == 0) {
            if(argcnt >= 2) {
                motorChars.maxLowCurrent=atoi(argptr[0]);
                motorChars.maxHighCurrent=atoi(argptr[1]);
            }
            if(argcnt >= 3) {
                motorChars.startOnPower=atoi(argptr[2]);
                setupStartPosition(motorChars.startOnPower);
            }
            if(argcnt >= 4) {
                motorChars.noOfMinCount=atoi(argptr[3]);
            }
            if(argcnt == 5) {
                motorChars.maxCalReps=atoi(argptr[4]);
            }
            appState=APP_IDLE;
        }
        else if(memcmp(APP_PRE_EEPSTATE,cmd,5) == 0) {
            if(argcnt == 1) {
                bool getEEState=atoi(argptr[0]);
                #ifdef EnvDevelop
                    UART_DBG.println("get eeprom state "+ String(getEEState));
                #endif
                if ((eepState==EEP_REQUEST) && (getEEState)) eepState=EEP_DONE; 
            }
            appState=APP_IDLE;
        }

        // match sensors request
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_MATCHSENS,&cmd[0],5) == 0) {			
            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                syslog.log(LOG_DEBUG, "stmApp: got match sensor answer");
            }
            appState=APP_IDLE;
		}

        // very important to reset to idle if no valid command was found
        else {
            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                syslog.log(LOG_DEBUG, "unknown command: >" + String(cmd) + "<");
            }
            appState=APP_IDLE;
        }

        cmd_buffer="";
        buffer[0] = '\0';
    }
}


void CStmApp::appHandler()
{
    switch (appState) {
        case APP_IDLE: 
            appRetry=0;   
            app_comm_machine();
            break;
        
        case APP_PENDING: 
            appRetry ++;
            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                syslog.log(LOG_DEBUG,"STMApp:App retries "+String(appRetry)+String(":")+String(commstate));
            }
            if (appRetry>maxAppRetries) {
                appState=APP_TIMEOUT;
                appRetry=0;
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                    syslog.log(LOG_DEBUG,"STMApp:Max app retries reached, set app to timeout");
                }
            }
            break;
        
        case APP_TIMEOUT:
            appTimeOuts++;
            if (appTimeOuts>maxAppTimeOuts) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                    syslog.log(LOG_DEBUG,"STMApp:Max app timeouts reached, reset STM");
                } 
                VdmSystem.setSystemState(systemStateError,systemMsgSTMReset);
                appTimeOuts=0; 
                Stm32.ResetSTM32(true);
                Messenger.sendMessage ("STM failed","STM failed: max app timeouts reached, reset STM"); 
                stmFailed=true;
                appState=APP_IDLE; 
            } else {
                commstate = COMM_GETDATA;
                app_comm_machine();   
            } 
            break;
        
        default:    
            appState=APP_IDLE;
            break;
    }
}

void CStmApp::app_comm_send(String thisAppCmd,uint8_t * value1,uint8_t * value2) 
{
    char valbuffer[20];
    memset(sendbuffer,0x0,sizeof(sendbuffer));
    strlcat(sendbuffer,thisAppCmd.c_str(),sizeof(sendbuffer));
    strlcat(sendbuffer," ",sizeof(sendbuffer));
    if (value1!=NULL) {
        itoa(*value1, valbuffer, 10);
        strlcat(sendbuffer,valbuffer,sizeof(sendbuffer));
        strlcat(sendbuffer," ",sizeof(sendbuffer));
        if (value2!=NULL) {
            itoa(*value2, valbuffer, 10);
            strlcat(sendbuffer,valbuffer,sizeof(sendbuffer));
            strlcat(sendbuffer," ",sizeof(sendbuffer));
        }
    }
    UART_STM32.println(sendbuffer);   
}

void  CStmApp::app_comm_machine()
{
    char valbuffer[10];

    switch(commstate) {

        case COMM_IDLE: 
                appState=APP_IDLE;
                if (checkNewTarget()) {
                    commstate = COMM_SENDTARGET;
                } else {
                    commstate = COMM_GETDATA;
                }
                break;

        // send target position values
        case COMM_SENDTARGET:
                commstate = COMM_GETDATA;
                
                for (uint8_t x=0; x<ACTUATOR_COUNT; x++) {
                    if (VdmConfig.configFlash.valvesConfig.valveConfig[x].active) {
                        // check if target has changed
                        if(target_position_mirror[x] != actuators[x].target_position)
                        {
                            target_position_mirror[x] = actuators[x].target_position;
                            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                                syslog.log(LOG_DEBUG, "STMApp:valve position has changed : "+String(VdmConfig.configFlash.valvesConfig.valveConfig[x].name)+"(#"+String(x+1)+") = "+String(actuators[x].target_position));
                            }
                            settarget_check=false;
                           
